# LmPerW Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..LmPerW Property
SymbolTypeId Class See Also
---
Symbol lm/W, indicating unit Lumens per watt.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId LmPerW { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property LmPerW As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ LmPerW {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace